tap "azure/kubelogin"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homebrew/aliases"
tap "homebrew/services"
tap "homeport/tap"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
tap "powershell/tap"
brew "aspell"
brew "autoconf"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "btop"
brew "chafa"
brew "cloudflared"
brew "container"
brew "container-compose"
brew "direnv"
brew "dstp"
brew "exercism"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "gawk"
brew "gdb"
brew "gh"
brew "git"
brew "gitu"
brew "glyph"
brew "gnupg"
brew "go"
brew "gpg-tui"
brew "helix"
brew "helm"
brew "hurl"
brew "jq"
brew "ijq"
brew "jj"
brew "jo"
brew "k9s"
brew "kakoune"
brew "kubescape"
brew "lazyjournal"
brew "mas"
brew "mermaid-cli"
brew "ollama"
brew "pandoc"
brew "pastel"
brew "pinentry-mac"
brew "pipenv"
brew "pkgconf"
brew "plantuml"
brew "poppler"
brew "prettier"
brew "python-setuptools"
brew "ripgrep"
brew "sdcv"
brew "shellcheck"
brew "sherlock"
brew "snyk-cli"
brew "stern"
brew "stow"
brew "tealdeer"
brew "telnet"
brew "tree"
brew "trufflehog"
brew "uv"
brew "vale"
brew "watch"
brew "wireshark", link: false
brew "yq"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-c9rgreen-sonoma-icon", "with-ctags", "with-imagemagick", "with-xwidgets"]
brew "homeport/tap/dyff"
brew "powershell/tap/powershell"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "aldente"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "atuin-desktop"
cask "betterdisplay"
cask "bettermouse"
cask "burp-suite"
cask "calibre"
cask "claude"
cask "container"
cask "corelocationcli"
cask "cursor"
cask "diskspace"
cask "docker-desktop"
cask "equinox"
cask "excalidrawz"
cask "flux-app"
cask "font-aporetic"
cask "font-caskaydia-cove-nerd-font"
cask "font-courier-prime"
cask "font-cousine-nerd-font"
cask "font-dejavu"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-geist-mono"
cask "font-go-mono-nerd-font"
cask "font-hack"
cask "font-inter"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-juliamono"
cask "font-liberation-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "forklift"
cask "freelens"
cask "ghostty"
cask "godot"
cask "google-chrome"
cask "gpg-suite"
cask "grandperspective"
cask "gstreamer-runtime"
cask "helium-browser"
cask "hyperkey"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "keyboardcleantool"
cask "lens"
cask "librewolf"
cask "little-snitch"
cask "mactex"
cask "microsoft-remote-desktop"
cask "pocket-casts"
cask "raindropio"
cask "readest"
cask "rectangle-pro"
cask "rider"
cask "signal"
cask "syncthing-app"
cask "tailscale-app"
cask "transmit"
cask "ungoogled-chromium"
cask "utm"
cask "vesktop"
cask "wireshark-app"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Balance Lock", id: 1019371109
mas "Captee", id: 6446053750
mas "Consent-O-Matic", id: 1606897889
mas "DeArrow", id: 6451469297
mas "Developer", id: 640199958
mas "Hand Mirror", id: 1502839586
mas "Ivory", id: 6444602274
mas "JSON Peep", id: 1458969831
mas "Kagi for Safari", id: 1622835804
mas "LocalSend", id: 1661733229
mas "ReadKit", id: 1615798039
mas "Reeder", id: 6475002485
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Scrim", id: 0
mas "Slack", id: 803453959
mas "SponsorBlock", id: 1573461917
mas "StopTheMadness Pro", id: 6471380298
mas "Tapestry", id: 6448078074
mas "TestFlight", id: 899247664
mas "uBlock Origin Lite", id: 6745342698
mas "Unread", id: 1363637349
mas "Userscripts", id: 1463298887
mas "Wallabag QuickSave", id: 1621482657
mas "Xcode", id: 497799835
mas "Yesterday For Old Reddit", id: 1603279883
vscode "alexkrechik.cucumberautocomplete"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "braver.vscode-solarized"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "jebbs.plantuml"
vscode "jetbrains.resharper-code"
vscode "linhmtran168.mac-ca-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mikestead.dotenv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryanolsonx.solarized"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "timonwong.shellcheck"
vscode "tuttieee.emacs-mcx"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
