tap "azure/kubelogin"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homebrew/aliases"
tap "homebrew/services"
tap "homeport/tap"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
tap "powershell/tap"
brew "aspell"
brew "astroterm"
brew "autoconf"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "btop"
brew "chafa"
brew "cloudflared"
brew "coreutils"
brew "cowsay"
brew "direnv"
brew "exercism"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "gawk"
brew "gdb"
brew "gh"
brew "git"
brew "gitu"
brew "glow"
brew "python-setuptools"
brew "glyph"
brew "gnupg"
brew "go"
brew "helix"
brew "helm"
brew "hurl"
brew "jq"
brew "ijq"
brew "k9s"
brew "kakoune"
brew "kubescape"
brew "lazyjournal"
brew "neovim"
brew "ollama"
brew "pandoc"
brew "pastel"
brew "pinentry-mac"
brew "pipenv"
brew "pkgconf"
brew "poppler"
brew "ripgrep"
brew "sdcv"
brew "shellcheck"
brew "sherlock"
brew "sl"
brew "snyk-cli"
brew "starship"
brew "stern"
brew "stow"
brew "svtplay-dl"
brew "tealdeer"
brew "telnet"
brew "topgrade"
brew "tree"
brew "vale"
brew "watch"
brew "wireshark", link: false
brew "xeyes"
brew "you-get"
brew "yt-dlp"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-imagemagick", "with-savchenkovaleriy-big-sur-3d-icon", "with-xwidgets"]
brew "homeport/tap/dyff"
brew "powershell/tap/powershell"
cask "1password"
cask "1password-cli"
cask "adobe-digital-editions"
cask "aerospace"
cask "aldente"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "betterdisplay"
cask "burp-suite"
cask "calibre"
cask "corelocationcli"
cask "docker-desktop"
cask "equinox"
cask "font-anonymice-nerd-font"
cask "font-aporetic"
cask "font-blex-mono-nerd-font"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-crimson-pro"
cask "font-dejavu"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-gnu-unifont"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inter"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-open-sans"
cask "font-recursive-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-terminus"
cask "ghostty"
cask "gimp"
cask "gpg-suite"
cask "grandperspective"
cask "gstreamer-runtime"
cask "hyperkey"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "keyboardcleantool"
cask "krita"
cask "lens"
cask "librewolf"
cask "linqpad"
cask "little-snitch"
cask "mactex"
cask "microsoft-remote-desktop"
cask "mouseless"
cask "obsidian"
cask "pocket-casts"
cask "postman"
cask "raindropio"
cask "rectangle-pro"
cask "rider"
cask "signal"
cask "stolendata-mpv"
cask "syncthing-app"
cask "tailscale-app"
cask "ungoogled-chromium"
cask "wireshark-app"
cask "xquartz"
cask "zed"
vscode "alexkrechik.cucumberautocomplete"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "braver.vscode-solarized"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "jebbs.plantuml"
vscode "linhmtran168.mac-ca-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mikestead.dotenv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryanolsonx.solarized"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "timonwong.shellcheck"
vscode "tuttieee.emacs-mcx"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
