tap "acsandmann/tap"
tap "azure/kubelogin"
tap "barutsrb/tap"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homeport/tap"
tap "ibm/iaccess", "https://public.dhe.ibm.com/software/ibmi/products/odbc/macos/tap/"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
brew "aspell"
brew "autoconf"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "bats-core"
brew "biome"
brew "btop"
brew "chafa"
brew "container", link: false
brew "container-compose"
brew "direnv"
brew "dstp"
brew "durdraw"
brew "exercism"
brew "fd"
brew "ffmpeg"
brew "fswatch"
brew "gawk"
brew "gdb"
brew "gh"
brew "git"
brew "gitu"
brew "glow"
brew "glyph"
brew "gnupg"
brew "go"
brew "gpg-tui"
brew "helix"
brew "helm"
brew "ijq"
brew "ingress2gateway"
brew "jj"
brew "jo"
brew "jq"
brew "k9s"
brew "kakoune"
brew "kubescape"
brew "lazyjournal"
brew "luarocks"
brew "mas"
brew "mermaid-cli"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "pastel"
brew "pinentry-mac"
brew "pipenv"
brew "pkgconf"
brew "plantuml"
brew "poppler"
brew "prettier"
brew "python-setuptools"
brew "ripgrep"
brew "sdcv"
brew "senpai"
brew "shellcheck"
brew "sherlock"
brew "sl"
brew "snyk-cli"
brew "stern"
brew "stow"
brew "tealdeer"
brew "telnet"
brew "tree"
brew "trufflehog"
brew "unixodbc"
brew "uv"
brew "vale"
brew "watch"
brew "wget"
brew "wireshark", link: false
brew "xdg-ninja", args: ["HEAD"]
brew "yq"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@31", args: ["with-xwidgets"]
brew "homeport/tap/dyff"
cask "alfred"
cask "anki"
cask "betterdisplay"
cask "bettermouse"
cask "bitwarden"
cask "burp-suite"
cask "calibre"
cask "container"
cask "corelocationcli"
cask "dbeaver-community"
cask "diskspace"
cask "docker-desktop"
cask "equinox"
cask "firefox@developer-edition"
cask "font-inter"
cask "font-iosevka-ss14"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "forklift"
cask "ghostty"
cask "gpg-suite"
cask "grandperspective"
cask "gstreamer-runtime"
cask "hyperkey"
cask "ibm/iaccess/ibm-iaccess"
cask "iina"
cask "iterm2"
cask "keyboardcleantool"
cask "little-snitch"
cask "mactex"
cask "microsoft-remote-desktop"
cask "netnewswire"
cask "raindropio"
cask "rectangle-pro"
cask "rider"
cask "syncthing-app"
cask "tailscale-app"
cask "transmit"
cask "vesktop"
cask "visual-studio-code"
cask "wireshark-app"
mas "Amphetamine", id: 937984704
mas "Balance Lock", id: 1019371109
mas "Barbee", id: 1548711022
mas "Consent-O-Matic", id: 1606897889
mas "DeArrow", id: 6451469297
mas "Developer", id: 640199958
mas "Hand Mirror", id: 1502839586
mas "Ivory", id: 6444602274
mas "Kagi for Safari", id: 1622835804
mas "Kagi News", id: 6748314243
mas "Kagi Translate for Safari", id: 0
mas "LocalSend", id: 1661733229
mas "Paprika Recipe Manager 3", id: 1303222628
mas "ReadKit", id: 1615798039
mas "Save to Raindrop.io", id: 1549370672
mas "Slack", id: 803453959
mas "SponsorBlock", id: 1573461917
mas "StopTheMadness Pro", id: 6471380298
mas "TestFlight", id: 899247664
mas "Userscripts", id: 1463298887
mas "Wallabag QuickSave", id: 1621482657
mas "Wallaroo", id: 1630565980
mas "wBlock", id: 6746388723
mas "Xcode", id: 497799835
mas "Yesterday For Old Reddit", id: 1603279883
vscode "anthropic.claude-code"
vscode "bierner.markdown-checkbox"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "editorconfig.editorconfig"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "ionide.ionide-fsharp"
vscode "mikestead.dotenv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-documentdb"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "redhat.vscode-yaml"
vscode "sonarsource.sonarlint-vscode"
vscode "vscodevim.vim"
cargo "rustlings"
cargo "txtv"
uv "kobodl"
